Tekla.Structures.Plugins.DetailTypeAttribute
The DetailTypeAttribute class is used for storing the detail type.
Based on the type the system will then position the detail in the creation.
The attribute is initialized from the custom attribute
[DetailType(DetailTypeEnum.END)]
in the connection source.

Tekla.Structures.Plugins.DetailTypeAttribute.#ctor(Tekla.Structures.DetailTypeEnum)
The custom attribute [DetailType()] uses this to store the type of the detail to the system.
This is not to be used by itself.
Type: The detail type.

Tekla.Structures.Plugins.DetailTypeAttribute.Type
The custom attribute [DetailType()] uses this to store the type of the detail to the system.
This is not to be used by itself.

Tekla.Structures.Plugins.DetailTypeAttribute.#ctor(System.Int32)
The custom attribute [DetailType()] uses this to store the type of the detail to the system.
This is not to be used by itself.
Type: The detail type.